{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_13", "layers": [{"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 48, 48, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_59", "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_78", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_46", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "filters": 64, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [3, 3], "name": "conv2d_60", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_79", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_47", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [3, 3], "name": "conv2d_61", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_80", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_48", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_9", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear", "name": "dense_23"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_81", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_14", "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 7, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear", "name": "dense_24"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_82", "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Sequential"}